{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_4",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 283,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense7",
            "trainable": true,
            "batch_input_shape": [
              null,
              283
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense8",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 2.0.1",
    "backend": "tensor_flow.js"
  },
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v2.0.1",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": [
        "/state-of-js-salary/data/stateOfJs-final.weights.bin"
      ],
      "weights": [
        {
          "name": "dense_Dense7/kernel",
          "shape": [
            283,
            283
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense7/bias",
          "shape": [
            283
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense8/kernel",
          "shape": [
            283,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense8/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
